beber007/zottaos/ZottaOS/CORTEX-Mx/STM32/ZottaOS_Interrupts.h
        defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
        defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
        defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_TIM6               54 /* TIM6 global */
  #endif
  #if defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
      defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_TIM7               55 /* TIM7 */
  #endif
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_DMA2_Channel1      56 /* DMA2 Channel 1 global */
     #define OS_IO_DMA2_Channel2      57 /* DMA2 Channel 2 global */
     #define OS_IO_DMA2_Channel3      58 /* DMA2 Channel 3 global */
  #endif
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     #define OS_IO_DMA2_Channel4_5    59 /* DMA2 Channel 4 and Channel 5 global */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_DMA2_Channel4      59 /* DMA2 Channel 4 global */
  #endif
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
     #define OS_IO_DMA2_Channel5      60 /* DMA2 Channel 5 global  (DMA2 Channel 5 is
                                            mapped at position 60 only if the MISC_REMAP
                                            bit in the AFIO_MAPR2 register is set) */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_DMA2_Channel5      60 /* DMA2 Channel 5 global */
  #endif
  #if defined(STM32F107XX)
     #define OS_IO_ETH                61 /* Ethernet global */
     #define OS_IO_ETH_WKUP           62 /* Ethernet Wakeup through EXTI line */
  #endif
  #if defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_CAN2_TX            63 /* CAN2 TX */
     #define OS_IO_CAN2_RX0           64 /* CAN2 RX0 */
     #define OS_IO_CAN2_RX1           65 /* CAN2 RX1 */
     #define OS_IO_CAN2_SCE           66 /* CAN2 SCE */
     #define OS_IO_OTG_FS             67 /* USB OTG FS global */
  #endif
/* ------------------------------ STM32F2 and STM32F4 --------------------------------- */
#elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
  #define OS_IO_ADC                   18  /* ADC1, ADC2 and ADC3 global  */
  #define OS_IO_CAN1_TX               19  /* CAN1 TX */
  #define OS_IO_CAN1_RX0              20  /* CAN1 RX0 */
  #define OS_IO_CAN1_RX1              21  /* CAN1 RX1 */
  #define OS_IO_CAN1_SCE              22  /* CAN1 SCE */
  #define OS_IO_EXTI9_5               23  /* External Line[9:5]  */
  #define OS_IO_TIM1_BRK_TIM9         24  /* TIM1 Break and TIM9 global */
  #define OS_IO_TIM9                  OS_IO_TIM1_BRK_TIM9
  #define OS_IO_TIM1_UP_TIM10         25  /* TIM1 Update and TIM10 global */
  #define OS_IO_TIM10                 OS_IO_TIM1_UP_TIM10
  #define OS_IO_TIM1_UP               OS_IO_TIM1_UP_TIM10
  #define OS_IO_TIM1_TRG_COM_TIM11    26  /* TIM1 Trigger and Commutation and TIM11
                                             global */
  #define OS_IO_TIM11                 OS_IO_TIM1_TRG_COM_TIM11
  #define OS_IO_TIM1_CC               27  /* TIM1 Capture Compare */
  #define OS_IO_TIM1                  OS_IO_TIM1_CC
  #define OS_IO_TIM2                  28  /* TIM2 global */
  #define OS_IO_TIM3                  29  /* TIM3 global */
  #define OS_IO_TIM4                  30  /* TIM4 global */
  #define OS_IO_I2C1_EV               31  /* I2C1 Event */
  #define OS_IO_I2C1_ER               32  /* I2C1 Error */
  #define OS_IO_I2C2_EV               33  /* I2C2 Event */
  #define OS_IO_I2C2_ER               34  /* I2C2 Error */
  #define OS_IO_SPI1                  35  /* SPI1 global */
  #define OS_IO_SPI2                  36  /* SPI2 global */
  #define OS_IO_USART1                37  /* USART1 global */
  #define OS_IO_USART2                38  /* USART2 global */
  #define OS_IO_USART3                39  /* USART3 global */
  #define OS_IO_EXTI15_10             40  /* External Line[15:10]  */
  #define OS_IO_RTC_Alarm             41  /* RTC Alarm (A and B) through EXTI Line */
  #define OS_IO_OTG_FS_WKUP           42  /* USB OTG FS Wakeup through EXTI line */
  #define OS_IO_TIM8_BRK_TIM12        43  /* TIM8 Break and TIM12 global */
  #define OS_IO_TIM12                 OS_IO_TIM8_BRK_TIM12
  #define OS_IO_TIM8_UP_TIM13         44  /* TIM8 Update and TIM13 global */
  #define OS_IO_TIM13                 OS_IO_TIM8_UP_TIM13
  #define OS_IO_TIM8_UP               OS_IO_TIM8_UP_TIM13
  #define OS_IO_TIM8_TRG_COM_TIM14    45  /* TIM8 Trigger and Commutation and TIM14
                                             global */
  #define OS_IO_TIM14                 OS_IO_TIM8_TRG_COM_TIM14
  #define OS_IO_TIM8_CC               46  /* TIM8 Capture Compare */
  #define OS_IO_TIM8                  OS_IO_TIM8_CC
  #define OS_IO_DMA1_Stream7          47  /* DMA1 Stream7 */
  #if defined(STM32F205VX_ZX) || defined(STM32F215VX_ZX) || defined(STM32F207XX) || \
      defined(STM32F217XX) || defined(STM32F405VX_ZX) || defined(STM32F415VX_ZX) || \
      defined(STM32F407XX) || defined(STM32F417XX)
     #define OS_IO_FSMC               48  /* FSMC global */
  #endif
  #define OS_IO_SDIO                  49  /* SDIO global */
  #define OS_IO_TIM5                  50  /* TIM5 global */
  #define OS_IO_SPI3                  51  /* SPI3 global */
  #define OS_IO_UART4                 52  /* UART4 global */
  #define OS_IO_UART5                 53  /* UART5 global */
  #define OS_IO_TIM6_DAC              54  /* TIM6 global and DAC1&2 underrun error   */
  #define OS_IO_TIM7                  55  /* TIM7 global */
  #define OS_IO_DMA2_Stream0          56  /* DMA2 Stream 0 global */
  #define OS_IO_DMA2_Stream1          57  /* DMA2 Stream 1 global */
  #define OS_IO_DMA2_Stream2          58  /* DMA2 Stream 2 global */
  #define OS_IO_DMA2_Stream3          59  /* DMA2 Stream 3 global */
  #define OS_IO_DMA2_Stream4          60  /* DMA2 Stream 4 global */
  #if defined(STM32F207XX) || defined(STM32F217XX) || defined(STM32F407XX) || \
      defined(STM32F417XX)
     #define OS_IO_ETH                61  /* Ethernet global */
     #define OS_IO_ETH_WKUP           62  /* Ethernet Wakeup through EXTI line */
  #endif
  #define OS_IO_CAN2_TX               63  /* CAN2 TX */
  #define OS_IO_CAN2_RX0              64  /* CAN2 RX0 */
  #define OS_IO_CAN2_RX1              65  /* CAN2 RX1 */
  #define OS_IO_CAN2_SCE              66  /* CAN2 SCE */
  #if defined(STM32F207XX) || defined(STM32F217XX) || defined(STM32F407XX) || \
      defined(STM32F417XX)
     #define OS_IO_OTG_FS             67  /* USB OTG FS global */
  #endif
  #define OS_IO_DMA2_Stream5          68  /* DMA2 Stream 5 global */
  #define OS_IO_DMA2_Stream6          69  /* DMA2 Stream 6 global */
  #define OS_IO_DMA2_Stream7          70  /* DMA2 Stream 7 global */
  #define OS_IO_USART6                71  /* USART6 global */
  #define OS_IO_I2C3_EV               72  /* I2C3 event */
  #define OS_IO_I2C3_ER               73  /* I2C3 error */
  #define OS_IO_OTG_HS_EP1_OUT        74  /* USB OTG HS End Point 1 Out global */
  #define OS_IO_OTG_HS_EP1_IN         75  /* USB OTG HS End Point 1 In global */
  #define OS_IO_OTG_HS_WKUP           76  /* USB OTG HS Wakeup through EXTI */
  #define OS_IO_OTG_HS                77  /* USB OTG HS global */
  #if defined(STM32F207XX) || defined(STM32F217XX) || defined(STM32F407XX) || \
      defined(STM32F417XX)
     #define OS_IO_DCMI               78  /* DCMI global */
  #endif
  #if defined(STM32F215RX) || defined(STM32F215VX_ZX) || defined(STM32F217XX) || \
      defined(STM32F415RG) || defined(STM32F415VG_ZG) || defined(STM32F417XX)
     #define OS_IO_CRYP               79  /* CRYP crypto global */
  #endif
  #define OS_IO_HASH_RNG              80  /* Hash and Rng global */
  #if defined(STM32F4XXXX)
     #define OS_IO_FPU                81  /* FPU global */
  #endif
#else
  #error STM32 version undefined
#endif


