beber007/zottaos/ZottaOS/CORTEX-Mx/STM32/ZottaOS_Interrupts.h
/* Claude les deux fonctions suivantes permettent d'enregisterer ou de récupèrer le decripteur d'un timer */
/* Elle doivent être obligatoirement utilisé à la place des fonctions OSSetISRDescriptor et OSGetISRDescriptor
** pour les vecteurs ayant 2 timer diffèrent comme source. Les Entrée de _OSTabDevice correspondant à ces vecteurs
** sont initialisé et pointe sur une stucture du type TIMERSELECT. Le champs TimerSelector des structure TIMERSELECT
** contienne tjs _OSTimerSelectorHandler. Ceci permet de facilement detecter que l'entrée correspond à un vecteur
** dont les sources proviennent de deux timers. */

/* OSSetTimerISRDescriptor: Associates an timer ISR descriptor with an _OSTabDevice
** sub-entry.
** Parameters:
**   (1) (UINT8) index of the _OSTabDevice entry;
**   (2) (UINT8) sub-index of the _OSTabDevice entry;
**   (3) (void *) ISR descriptor for the specified interrupt.
** Returned value: none. */
void OSSetTimerISRDescriptor(UINT8 entry, UINT8 subentry, void *descriptor);

/* OSGetTimerISRDescriptor: Returns the timer ISR descriptor associated with an
** _OSTabDevice sub-entry.
** Parameters:
**   (1) (UINT8) index of _OSTabDevice where the timer selection descriptor is held;
**   (2) (UINT8) sub-index of _OSTabDevice where the timer ISR descriptor is held.
** Returned value: (void *) The requested timer ISR descriptor is returned. If no previous
**    OSSetTimerISRDescriptor was previously made for the specified entry, the returned
**    value is undefined. */
void *OSGetTimerISRDescriptor(UINT8 entry, UINT8 subentry);

#endif /* _ZOTTAOS_INTERRUPTS_ */

